Обработки/Reports/_АнкетаЭкспертРА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_АнкетаЭкспертРА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_АнкетаЭкспертРА/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Анкета ""Эксперт РА""",
		"1.18",
		"",
		Истина
	);
		
	// Команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	Механизм = "ВнешнийОтчет._АнкетаЭкспертРА.ПриКомпоновкеРезультата()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ВнешниеНаборыДанных = Новый Структура("ДанныеОтчета", ПолучитьДанныеОтчета()); 
	ДополнительныеПараметры = Новый Структура("РегистрацияСтатистики", Ложь);
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,, ВнешниеНаборыДанных, ДополнительныеПараметры);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьДанныеОтчета() Экспорт

	Запрос = Новый Запрос;
	
	ПоследнийРабочийДень = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаОкончания);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", ПоследнийРабочийДень);
	Запрос.УстановитьПараметр("СуммаСобственныхСредств", РаботаСВнешнимиСистемами.ПолучитьСтоимостьСобственныхСредствИзБухгалтерии(ЭтотОбъект.Организация, ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВерсияОтчета", ПолучитьВерсиюОтчета(ЭтотОбъект.Период.ДатаОкончания));
	
	#Область Текст_запроса_актуальные_счета_ДУ
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА ""Объем собственных средств УК""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ВЫБОР
		|					КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
		|						ТОГДА ""ЗПИФ (количество пайщиков с ненулевыми счетами)""
		|					ИНАЧЕ ВЫБОР
		|							КОГДА &ВерсияОтчета = 1
		|								ТОГДА ""ОПИФ, ИПИФ, БПИФ (количество клиентов с ненулевыми счетами)""
		|							КОГДА &ВерсияОтчета = 2 ИЛИ &ВерсияОтчета = 3
		|								ТОГДА ВЫБОР
		|										КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
		|											ТОГДА ""Открытые ПИФы""
		|										КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)
		|											ТОГДА ""Биржевые ПИФы""
		|										КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный)
		|											ТОГДА ""Интервальные ПИФы""
		|									КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""Пенсионные резервы НПФ""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""Пенсионные накопления НПФ""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА ""Пенсионные накопления ПФР""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний))
		|			ТОГДА ""Резервы и собственные средства страховых компаний""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА ""Фонды СРО""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА ""Фонды целевых капиталов""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ТОГДА ""Военная ипотека""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ))
		|			ТОГДА ""Индивидуальное доверительное управление средствами корпоративных клиентов""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|			ТОГДА ""Индивидуальное доверительное управление средствами физических лиц""
		|		ИНАЧЕ ""Прочее""
		|	КОНЕЦ КАК РазделОтчета,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА 0
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ВЫБОР
		|					КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
		|						ТОГДА 2
		|					ИНАЧЕ ВЫБОР
		|							КОГДА &ВерсияОтчета = 1
		|								ТОГДА 1
		|							КОГДА &ВерсияОтчета = 2 ИЛИ &ВерсияОтчета = 3
		|								ТОГДА ВЫБОР
		|										КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
		|											ТОГДА 1
		|										КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)
		|											ТОГДА 1.1
		|										КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный)
		|											ТОГДА 1.2
		|									КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА 3
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА 4
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА 5
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний))
		|			ТОГДА 6
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА 7
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА 8
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ТОГДА 9
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ))
		|			ТОГДА 11
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|			ТОГДА 12
		|		ИНАЧЕ 13
		|	КОНЕЦ КАК ПорядокРазделов
		|ПОМЕСТИТЬ _РазделыОтчета
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПаевыеИнвестиционныеФонды.Ссылка
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &КонецПериода)
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &КонецПериода
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК Период
		|ПОМЕСТИТЬ _ДатаПервойОперации
		|ИЗ
		|	_РазделыОтчета КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	МИНИМУМ(ВложенныйЗапрос.Период)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РазделыОтчета КАК СчетаДоверительногоУправления
		|			ПО ОстаткиДенежныхСредств.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|				И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		ОстаткиДенежныхСредств.Активность
		|		И ОстаткиДенежныхСредств.Период <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|		ОстаткиЦенныхБумаг.Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РазделыОтчета КАК СчетаДоверительногоУправления
		|			ПО ОстаткиЦенныхБумаг.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|				И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		ОстаткиЦенныхБумаг.Активность
		|		И ОстаткиЦенныхБумаг.Период <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.РазделОтчета КАК РазделОтчета,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ДатаПервойОперации.Период КАК ДатаЗаключения,
		|	_СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	_СчетаДоверительногоУправления.ПорядокРазделов КАК ПорядокРазделов
		|ПОМЕСТИТЬ _АктуальныеСчетаДоверительногоУправления
		|ИЗ
		|	_РазделыОтчета КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатаПервойОперации КАК _ДатаПервойОперации
		|		ПО _СчетаДоверительногоУправления.Ссылка = _ДатаПервойОперации.СчетДоверительногоУправления";
	#КонецОбласти 
	
	Запрос.Выполнить();
	
	Если ПоследнийРабочийДень = НачалоДня(ЭтотОбъект.Период.ДатаОкончания) Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.Организация КАК Организация,
			|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	&КонецПериода КАК Дата
			|ПОМЕСТИТЬ _ДатыРасчетаСЧА
			|ИЗ
			|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления";
		Запрос.Выполнить();
	Иначе
		ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос);
	КонецЕсли; 
		
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.РазделОтчета КАК РазделОтчета,
		|	_СчетаДоверительногоУправления.ПорядокРазделов КАК ПорядокРазделов,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_ДатыРасчетаСЧА.Дата КАК ДатаСЧА,
		|	ЕСТЬNULL(СЧА.Значение, 0) КАК СЧА
		|ИЗ
		|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыРасчетаСЧА КАК _ДатыРасчетаСЧА
		|		ПО _СчетаДоверительногоУправления.Организация = _ДатыРасчетаСЧА.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = _ДатыРасчетаСЧА.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.СубъектАналитики = _ДатыРасчетаСЧА.СчетДоверительногоУправления)
		|			И (СЧА.Период = _ДатыРасчетаСЧА.Дата)
		|			И (СЧА.Организация = _ДатыРасчетаСЧА.Организация)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|ГДЕ
		|	(&ВерсияОтчета = 1
		|			ИЛИ ЕСТЬNULL(СЧА.Значение, 0) <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Организации.Ссылка,
		|	""Объем собственных средств УК"",
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный),
		|	Организации.ЮрФизЛицо,
		|	&КонецПериода,
		|	&СуммаСобственныхСредств
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	#КонецОбласти 
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(_СчетаДоверительногоУправления.ДатаЗаключения, ДЕНЬ) < &ПоследнийРабочийДень
		|			ТОГДА &ПоследнийРабочийДень
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(_СчетаДоверительногоУправления.ДатаЗаключения, ДЕНЬ)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.ДатаРасторжения > &КонецПериода
		|				ИЛИ _СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &КонецПериода
		|		ИНАЧЕ _СчетаДоверительногоУправления.ДатаРасторжения
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|";
	
	Запрос.Выполнить();
	
	ПараметрыДатСЧА = Новый Структура("ВидДействия, ДополнитьРабочимиДнями, ИмяТаблицыДатДействияЗаПериод, УдалитьВсеВременныеТаблицы", 
									"СЧА", Ложь, "_ВсеДатыРасчетаСЧА", Истина);
	
	Запрос.Текст = Справочники.НастройкиРегламентныхДействий.ПолучитьТекстЗапросаПоДатамРегламентныхДействий(ПараметрыДатСЧА);
	
	Запрос.Текст = стрЗаменить(Запрос.Текст, "&ДатаС", "&ПоследнийРабочийДень");
	Запрос.Текст = стрЗаменить(Запрос.Текст, "&ДатаПо", "&КонецПериода");
	
	Запрос.Выполнить();
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеДатыРасчетаСЧА.Организация КАК Организация,
		|	_ВсеДатыРасчетаСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(_ВсеДатыРасчетаСЧА.Дата) КАК Дата
		|ПОМЕСТИТЬ _ДатыРасчетаСЧА
		|ИЗ
		|	_ВсеДатыРасчетаСЧА КАК _ВсеДатыРасчетаСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВсеДатыРасчетаСЧА.СчетДоверительногоУправления,
		|	_ВсеДатыРасчетаСЧА.Организация";
	Запрос.Выполнить();
	
	Запрос.Текст = 	
		"УНИЧТОЖИТЬ _СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеДатыРасчетаСЧА";
		
	Запрос.Выполнить();
	
	
КонецПроцедуры

Функция ПолучитьИдентификаторОрганизацииВБухгалтерии(Организация)

	Если Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "24f247b5-fc83-4b90-94b9-f48f5b4c897b";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "25edd09e-d191-42ba-8dad-254d7b4f535d";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "a10bacb9-5299-11e3-934d-000c29e4a50d";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "eb907965-5cfb-11e9-80d1-005056ae724d";
	КонецЕсли;
	
	Возврат ИдентификаторОрганизацииВБухгалтерии;

КонецФункции
 
Функция ПолучитьВерсиюОтчета(ДатаОкончания) Экспорт

	Если ДатаОкончания <= КонецКвартала('20210101') Тогда
		ВерсияОтчета = 1;
	ИначеЕсли ДатаОкончания <= '20210630235959' Тогда
		ВерсияОтчета = 2;
	Иначе
		ВерсияОтчета = 3;
	КонецЕсли; 
	
	Возврат ВерсияОтчета;

КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики() Экспорт
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", 	ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("ДатаНачала", 		ЭтотОбъект.Период.ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаОкончания", 	ЭтотОбъект.Период.ДатаОкончания);
	ПараметрыОтчета.Вставить("Версия", 			СведенияОВнешнейОбработке().Версия);
	
	Описание = "";
	
	Для каждого Параметр Из ПараметрыОтчета Цикл
	
		Описание = Описание + Символы.ПС + Параметр.Ключ + ": " + Параметр.Значение;
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции
